In [2]:
import numpy as np
import pandas as pd

C:\Users\Shubham\AppData\Local\Temp\ipykernel_6716\1662815981.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:

data={
    'calories':[100,200,300,400,500,600],
    'duration':[500,400,20,30,40,50]
}

df=pd.DataFrame(data)
print(df)
print("======================================================================")
print(df.loc[[0,1]])
print("======================================================================")
df=pd.DataFrame(data,index=["day1","day2","day3","day4","day5","day6"])
print(df)

   calories  duration
0       100       500
1       200       400
2       300        20
3       400        30
4       500        40
5       600        50
======================================================================
   calories  duration
0       100       500
1       200       400
======================================================================
      calories  duration
day1       100       500
day2       200       400
day3       300        20
day4       400        30
day5       500        40
day6       600        50

In [3]:
dict={
    "name":['omkar','nil','ayush','krishna'],
    "marks":[97,67,45,35],
    "city":['rampur','hipparga','shirdi','nanded']
}

In [5]:
df=pd.DataFrame(dict) #create dataframe like excel sheet

In [6]:
df

      name  marks      city
0    omkar     97    rampur
1      nil     67  hipparga
2    ayush     45    shirdi
3  krishna     35    nanded

In [7]:
#convert this dataframe to exvel file
df.to_csv('friends.csv')

In [9]:
#if you dont want index in csv file
df.to_csv('friends_withount_index.csv',index=False)

In [11]:
df.head(2)

    name  marks      city
0  omkar     97    rampur
1    nil     67  hipparga

In [12]:
df.tail(2)

      name  marks    city
2    ayush     45  shirdi
3  krishna     35  nanded

In [13]:
df.describe()

           marks
count   4.000000
mean   61.000000
std    27.471197
min    35.000000
25%    42.500000
50%    56.000000
75%    74.500000
max    97.000000

In [22]:
#conver from csv to dataframe
omkar = pd.read_csv('omkar.csv')

In [23]:
omkar

   roll no     name      city
0        1    omkar    rampur
1        2  krishna    nanded
2        3    ayush    shirdi
3        4      nil  hipparga
4        5   manasi     jalna

In [25]:
omkar['name']

0      omkar
1    krishna
2      ayush
3        nil
4     manasi
Name: name, dtype: object

In [26]:
omkar['name'][3]

'nil'

In [28]:
omkar['name'][0]='kasture'

C:\Users\Shubham\AppData\Local\Temp\ipykernel_4268\4146229709.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  omkar['name'][0]='kasture'

In [29]:
omkar

   roll no     name      city
0        1  kasture    rampur
1        2  krishna    nanded
2        3    ayush    shirdi
3        4      nil  hipparga
4        5   manasi     jalna

In [30]:
# save changes in local file
omkar.to_csv('omkar.csv')

In [32]:
# change index
omkar.index=['first','second','third','fourth','fifth']

In [33]:
omkar

        roll no     name      city
first         1  kasture    rampur
second        2  krishna    nanded
third         3    ayush    shirdi
fourth        4      nil  hipparga
fifth         5   manasi     jalna

In [7]:
#converting and overwriting values in column
data={
    'Name':['omkar','ayush','krishna','atharva','nill'],
    'Age':[19,20,40,31,14],
    'Address':['nanded','shirdi','nanded','solapur','nanded'],
    'Qualification':["Btech","BCA","BBA","BSC","MBBS"]
}

df=pd.DataFrame(data)
print(df)

      Name  Age  Address Qualification
0    omkar   19   nanded         Btech
1    ayush   20   shirdi           BCA
2  krishna   40   nanded           BBA
3  atharva   31  solapur           BSC
4     nill   14   nanded          MBBS